data/Parm_PH_29/alpha_15/alpha_15_7929_3036/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.00361643 -0.00002735 0.00000000 0.00000328 0.00000000 0.00208622)
(0.00401858 -0.00003341 0.00000000 0.00000444 0.00000000 0.00225722)
(0.00399294 -0.00002697 0.00000000 0.00000119 0.00000000 0.00213358)
(0.00276259 -0.00001501 0.00000000 -0.00000390 0.00000000 0.00121902)
(0.00152349 -0.00016645 0.00000000 0.00003873 0.00000000 0.00211142)
(0.00022564 -0.00014771 0.00000000 0.00010129 0.00000000 0.00108359)
(0.00080963 0.00001415 0.00000000 -0.00002235 0.00000000 0.00113598)
(0.00061112 0.00004156 0.00000000 -0.00001787 0.00000000 0.00128148)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
